In [3]:
edad = 55 
if edad < 50:
    print("Edad menor de 50")
else:
    print("Edad mayor de 50")

Edad mayor de 50

In [5]:
#para tener mas de 2 opciones de devolucion, voy a usar el elif
if edad < 30:
    print("Edad entre 0 y 30")
elif edad < 60:
    print("Edad entre 30 y 60")
elif edad < 90:
    print("Edad mayor o igual a 60")
else:
    print("mas de 90")

Edad entre 30 y 60

In [6]:
#mediante una funcion personalizada , que nos devuelva el pack de compra
#segun los valores de una lista de importe de ventas
#lista tnedr 24,35,62,18,71,95,114,44
#los packs van en multiplo de 30
#de manera que cuando venga el numero 24 me tendra que devolver un texto que ponga
#24 es el pack de 30, pongo 35 es el pack de 60, etc..

In [18]:
cantidad=[24,35,62,18,71,95,114,44]
#funcion que devuelva el pack
def pack(x):
    for i in x:
        if i <= 30:
            print("el " +str(i) + " es el pack de 30")
        elif i <=60:
            print("el " +str(i) + " es el pack de 60")
        elif i <= 90:
            print("el " +str(i) + " es el pack de 90")
        elif i <=120:
            print("el " +str(i) + " es el pack de 120")
        else:
            print("es mayor que el pack de 120")

In [19]:
pack (cantidad)

el 24 es el pack de 30
el 35 es el pack de 60
el 62 es el pack de 90
el 18 es el pack de 30
el 71 es el pack de 90
el 95 es el pack de 120
el 114 es el pack de 120
el 44 es el pack de 60

In [69]:
#TENDRE UNA LISTA CON LAS SIGUIENTES EDADES

#averiguar cuantas edades hay por franjas de multiplo 10
#necesitaria una variable por franja de edad que me acumule la cntidad de personas
#tengo 0 personas entre 0-10
#tengo 2 personas entre 10 -20
#tengo 2 personas entre 20-30

edades=[8,18,35,44,62,21,14,57,66,73,46,11,28,37,38,53,62]
franjas=[0,0,0,0,0,0,0,0]
texto =[]
a=0
b=0
c=0
d=0
e=0
f=0
g=0
h=0

for x in edades:
    if x <= 10:
        frnajas[0]
    elif x <= 20:
        b+=1
    elif x <= 30:
        c+=1
    elif x <= 40:
        d+=1
    elif x <= 50:
        e+=1
    elif x <= 60:
        f+=1
    elif x <= 70:
        g+=1
    elif x <= 80:
        h+=1    
    else:
        print("es mayor que el pack de 80")

In [70]:
print( "entre 0-10 " + str(a))
print( "entre 0-20 " + str(b))
print( "entre 0-30 " + str(c))
print( "entre 0-40 " + str(d))
print( "entre 0-50 " + str(e))
print( "entre 0-60 " + str(f))
print( "entre 0-70 " + str(g))
print( "entre 0-80 " + str(h))

entre 0-10 1
entre 0-20 3
entre 0-30 2
entre 0-40 3
entre 0-50 2
entre 0-60 2
entre 0-70 3
entre 0-80 1

In [72]:
#en un bucle for trabajar con break y con continue
#break sale del bucle
#continue salta una iteracion
for i in 'Domingo':
    if i =='n':
        continue
    print(i)

D
o
m
i
g
o

In [76]:
#parctica: una lista llamada meses enero -junio
#imprimir el mes hasta mayo

meses=['enero', 'febrero', 'marzo', 'abril', 'mayo', 'junio']

for i in meses:
    if i == 'mayo':
        break
    print(i)

#practica: imprimir por separado las letras de la palabra
#supercaligragilisticoespialidoso, menos las a

enero
febrero
marzo
abril

In [79]:
for i in 'supercaligragilisticoespialidoso':
        if i =='a':
            continue
        print(i)

s
u
p
e
r
c
l
i
g
r
g
i
l
i
s
t
i
c
o
e
s
p
i
l
i
d
o
s
o

In [81]:
#vamos a ver las librerias de python
#para trabajar con la libreria 2 pasos , primero instalar
#segundo llamar
#pip install pandas
#pandas es una libreria enfocad a datos cientificos , con ella se pueden
#manipular datos, cuando se instala pandas tambien se instala numpy, pytz
#para trabajar con pandas, disponemos de 3 objetos
#son las series, son estructuras de 1 dimension(acompanadas de un indice)
#los DataFrame, son estructuras de 2 dimensiones (una tabla de BBDD)
#Los paneles, son estructuras de 3 dimensiones (cubos)
#como llamar a una libreria en Python, con la palabra import
import pandas as pd
#vamos a crear una serie con valores manuales, las series son homogeneas
#que contienen el mismo tipo de datos
serie = pd.Series(['lunes','martes', 'miercoles','jueves'],dtype='string')
print(serie)

0        lunes
1       martes
2    miercoles
3       jueves
dtype: string

In [83]:
serie[0]

'lunes'

In [84]:
serie[2]

'miercoles'

In [85]:
#podemos acceder a la serie de elementos con su indice

In [87]:
#vamos a cargar una serie a partir de una lista
numeros =[75,241.35,687,187.56, 158,900]
serie_numeros = pd.Series(data=numeros)
serie_numeros

0     75.00
1    241.35
2    687.00
3    187.56
4    158.00
5    900.00
dtype: float64

In [88]:
#resumenes estadisticos de una serie, el numero de elementos
#de la serie con count
serie_numeros.count()

6

In [89]:
#como sumar todos los elemetos con sum()
serie_numeros.sum()

2248.91

In [90]:
#como ver la suma acumulada con cumsum()
serie_numeros.cumsum()

0      75.00
1     316.35
2    1003.35
3    1190.91
4    1348.91
5    2248.91
dtype: float64

In [91]:
#vamos a ver el valor mas grande, el valor mas pequeno
#y el promedio
print(serie_numeros.max()) #+grande
print(serie_numeros.min()) #+pequeno
print(serie_numeros.mean()) #el promedio

900.0
75.0
374.8183333333333

In [92]:
#vamos a ver como calcular la varianza
print(serie_numeros.var())

112610.77561666665

In [93]:
#vamos a calcular la desviacion tipica
print(serie_numeros.std())

335.57529053353534

In [94]:
#como ver un resumen estadistico comn describe()
serie_numeros.describe()

count      6.000000
mean     374.818333
std      335.575291
min       75.000000
25%      165.390000
50%      214.455000
75%      575.587500
max      900.000000
dtype: float64

In [95]:
#aplicar una operacion ARITMETICA A UNA SERIE
serie_numeros +10

0     85.00
1    251.35
2    697.00
3    197.56
4    168.00
5    910.00
dtype: float64

In [96]:
serie_numeros*3

0     225.00
1     724.05
2    2061.00
3     562.68
4     474.00
5    2700.00
dtype: float64

In [100]:
#como ordenar una serie, con sort values
#o ascending = False, con ignore_index = True
serie_numeros.sort_values(ascending = True, ignore_index=True)

0     75.00
1    158.00
2    187.56
3    241.35
4    687.00
5    900.00
dtype: float64

In [102]:
#Estructuras de 2 dimensiones DataFrame, primero de manera manual
import pandas as pd
df = pd.DataFrame([{'Nombre':'Pedro', 'Edad':25, 'Estatura':1.80},
                    {'Nombre':'Marina', 'Edad':20, 'Estatura':1.70},
                    {'Nombre':'Luis', 'Edad':44, 'Estatura':1.67},
                    {'Nombre':'Marta', 'Edad':53, 'Estatura':1.76}])
df

   Nombre  Edad  Estatura
0   Pedro    25      1.80
1  Marina    20      1.70
2    Luis    44      1.67
3   Marta    53      1.76

In [103]:
#como ver la estructura 
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 3 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Nombre    4 non-null      object
 1   Edad      4 non-null      int64
 2   Estatura  4 non-null      float64
dtypes: float64(1), int64(1), object(1)
memory usage: 228.0+ bytes

In [105]:
#como ver los primeros n registro de un DataFrame
df.head(3)

   Nombre  Edad  Estatura
0   Pedro    25      1.80
1  Marina    20      1.70
2    Luis    44      1.67

In [106]:
#como ver los ultimos n registros de un dataFrame
df.tail(2)

  Nombre  Edad  Estatura
2   Luis    44      1.67
3  Marta    53      1.76

In [110]:
#como ver solamente los registros de un campo y poder trabajar con ellos
df['Nombre']

0     Pedro
1    Marina
2      Luis
3     Marta
Name: Nombre, dtype: object

In [111]:
df['Edad'].sum()

142

In [113]:
#el promedio de las edades
df['Edad'].mean()

35.5

In [115]:
#el promedio de las edades
df['Edad'].max()

53

In [120]:
#como anadir un columna a dataframe
#opcion a , valor unico puesto de manera manual
df['Localidad'] = 'Barcelona'
df

   Nombre  Edad  Estatura  Localidad
0   Pedro    25      1.80  Barcelona
1  Marina    20      1.70  Barcelona
2    Luis    44      1.67  Barcelona
3   Marta    53      1.76  Barcelona

In [123]:
#opcion b, haciendo un calculo con una columna o campo existente
df['Edad2'] = df['Edad'] -5
df

   Nombre  Edad  Estatura  Localidad  Edad2
0   Pedro    20      1.80  Barcelona     15
1  Marina    15      1.70  Barcelona     10
2    Luis    39      1.67  Barcelona     34
3   Marta    48      1.76  Barcelona     43

In [125]:
#practica, crear un data frame con los siguientes datos
#cliente = cliente1, ventas = 2800
#cliente = cliente2, ventas = 3450
#cliente = cliente3, ventas = 1870
#cliente = cliente4, ventas = 2458
#cliente = cliente5, ventas = 6053
#crear una columna nueva que contenga el 3% sobre las ventas (0.03)
#crear una columna nueva que contenga las ventas neto(ventas-descuento)
#averiguar el vaklor mas alto de ventas neto
#averiguar la suma del descuento aplicado
#averiguar el promedio de ventas
#averiguar la suma acumulada de ventas neto
#ver el campo ventas ordenado de manera descendente

import pandas as pd
clientes = pd.DataFrame([{'Cliente':'cliente1', 'Ventas': 2800 },
                        {'Cliente':'cliente2', 'Ventas': 3450 },
                        {'Cliente':'cliente3', 'Ventas': 1870 },
                        {'Cliente':'cliente4', 'Ventas': 2458 },
                        {'Cliente':'cliente5', 'Ventas': 6053 }])
clientes

    Cliente  Ventas
0  cliente1    2800
1  cliente2    3450
2  cliente3    1870
3  cliente4    2458
4  cliente5    6053

In [126]:
clientes['3%'] = clientes['Ventas']*0.03
clientes

    Cliente  Ventas      3%
0  cliente1    2800   84.00
1  cliente2    3450  103.50
2  cliente3    1870   56.10
3  cliente4    2458   73.74
4  cliente5    6053  181.59

In [127]:
clientes['ventasneto'] = clientes['Ventas'] - clientes['3%']
clientes

    Cliente  Ventas      3%  ventasneto
0  cliente1    2800   84.00     2716.00
1  cliente2    3450  103.50     3346.50
2  cliente3    1870   56.10     1813.90
3  cliente4    2458   73.74     2384.26
4  cliente5    6053  181.59     5871.41

In [128]:
clientes['ventasneto'].max()
clientes

    Cliente  Ventas      3%  ventasneto
0  cliente1    2800   84.00     2716.00
1  cliente2    3450  103.50     3346.50
2  cliente3    1870   56.10     1813.90
3  cliente4    2458   73.74     2384.26
4  cliente5    6053  181.59     5871.41

In [129]:
print(clientes['ventasneto'].max())

5871.41

In [136]:
"{0:.2f}".format(clientes['3%'].sum())

'498.93'

In [131]:
clientes['Ventas'].mean()

3326.2

In [132]:
clientes['ventasneto'].sum()

16132.07

In [135]:
clientes['Ventas'].sort_values(ascending = False)

4    6053
1    3450
0    2800
3    2458
2    1870
Name: Ventas, dtype: int64